content/posts-org/GENP-1280.org
#+hugo_base_dir: ../../
# -*- mode: org; coding: utf-8; -*-
* Header Information                                               :noexport:
#+LaTeX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER: \usepackage{helvetica}
#+LATEX_HEADER: \setlength{\textwidth}{5.1in} % set width of text portion
#+LATEX_HEADER: \usepackage{geometry}
#+TITLE:     GENP-1280
#+AUTHOR:    Fei Ni
#+EMAIL:     fei.ni@helix.com
#+DATE:      2021-01-01
#+HUGO_CATEGORIES: helix
#+HUGO_tags: helix
#+hugo_auto_set_lastmod: t
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   ^:{}
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+HTML_HEAD: <link rel="stylesheet" href="org.css" type="text/css"/>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+STARTUP: hidestars

#+STARTUP: overview   (or: showall, content, showeverything)
http://orgmode.org/org.html#Visibility-cycling  info:org#Visibility cycling

#+TODO: TODO(t) NEXT(n) STARTED(s) WAITING(w@/!) SOMEDAY(S!) | DONE(d!/!) CANCELLED(c@/!)
http://orgmode.org/org.html#Per_002dfile-keywords  info:org#Per-file keywords

#+TAGS: important(i) private(p)
#+TAGS: @HOME(h) @OFFICE(o)
http://orgmode.org/org.html#Setting-tags  info:org#Setting tags

#+NOstartup: beamer
#+NOLaTeX_CLASS: beamer
#+NOLaTeX_CLASS_OPTIONS: [bigger]
#+NOBEAMER_FRAME_LEVEL: 2


# Start from here


* Scenarios

While scanning Sample2, there are following scenarios

Notice: Sample1 and Sample2 having the same partner barcode

| Scenario Name | Sample1 Scan status | Sample1 report deliver status | expected result                                                                                                            | Notes                                     |
|---------------+---------------------+-------------------------------+----------------------------------------------------------------------------------------------------------------------------+-------------------------------------------|
| S1            | Scanned             | delivered                     | not allowed to scan Sample2, cancel Sample1 in LIMS and report service, /notify user the previous report is not a valid one/ | working on solution                       |
| S2            | Scanned             | Not delivered                 | not allowed to scan Sample2, cancel Sample1 in LIMS and report service                                                     | Solutions are identified, 2 Jiras created |
|---------------+---------------------+-------------------------------+----------------------------------------------------------------------------------------------------------------------------+-------------------------------------------|


Also, we got the 3rd scenario:

Sample1, Sample2, Sample3 having the same partner barcode.

- Sample1 completed the scanning, and delivered the report
- While doing Sample2 scanning, we found it's duplicated with Sample1, we just cancel Sample1 in LIMS and report service, also notify user the report of Sample1 is invalid
- While doing Sample3 scanning, we found it's a duplicated one also a processed duplicated one, we may just treat it as brand new sample to complete the process (is it true?).



