content/posts/GENP-1280.md
+++
title = "GENP-1280"
author = ["Fei Ni"]
date = 2021-06-09T11:15:35-07:00
lastmod = 2021-06-09T11:15:35-07:00
tags = ["helix"]
categories = ["helix"]
draft = false
+++

## <span class="section-num">1</span> Scenarios {#scenarios}

While scanning Sample2, there are following scenarios

Notice: Sample1 and Sample2 having the same partner barcode

| Scenario Name | Sample1 Scan status | Sample1 report deliver status | expected result                                                                                                              | Notes                                     |
|---------------|---------------------|-------------------------------|------------------------------------------------------------------------------------------------------------------------------|-------------------------------------------|
| S1            | Scanned             | delivered                     | not allowed to scan Sample2, cancel Sample1 in LIMS and report service, _notify user the previous report is not a valid one_ | working on solution                       |
| S2            | Scanned             | Not delivered                 | not allowed to scan Sample2, cancel Sample1 in LIMS and report service                                                       | Solutions are identified, 2 Jiras created |

Also, we got the 3rd scenario:

Sample1, Sample2, Sample3 having the same partner barcode.

-   Sample1 completed the scanning, and delivered the report
-   While doing Sample2 scanning, we found it's duplicated with Sample1, we just cancel Sample1 in LIMS and report service, also notify user the report of Sample1 is invalid
-   While doing Sample3 scanning, we found it's a duplicated one also a processed duplicated one, we may just treat it as brand new sample to complete the process (is it true?).
